{
    "application_number": "10465416",
    "publication_number": "US20050069836A1-20050331",
    "title": "Dental filling material",
    "decision": "ACCEPTED",
    "date_produced": "20050316",
    "date_published": "20050331",
    "main_cpc_label": "",
    "cpc_labels": [],
    "main_ipcr_label": "",
    "ipcr_labels": [],
    "patent_number": "7211136",
    "filing_date": "20030618",
    "patent_issue_date": "20070501",
    "abandon_date": "",
    "uspc_class": "106",
    "uspc_subclass": "035000",
    "examiner_id": "95539.0",
    "examiner_name_last": "KOSLOW",
    "examiner_name_first": "CAROL",
    "examiner_name_middle": "",
    "inventor_list": [
        {
            "inventor_name_last": "Jia",
            "inventor_name_first": "Weitao",
            "inventor_city": "Wallingford",
            "inventor_state": "CT",
            "inventor_country": "US"
        },
        {
            "inventor_name_last": "Trope",
            "inventor_name_first": "Martin",
            "inventor_city": "Wallinford",
            "inventor_state": "CT",
            "inventor_country": "US"
        },
        {
            "inventor_name_last": "Alpert",
            "inventor_name_first": "Bruce",
            "inventor_city": "Wynnewood",
            "inventor_state": "PA",
            "inventor_country": "US"
        }
    ],
    "abstract": "A dental filling material comprising a thermoplastic polymer. The thermoplastic polymer may be biodegradable. A bioactive substance may also be included in the filling material. The thermoplastic polymer acts as a matrix for the bioactive substance. The composition may include other polymeric resins, fillers, plasticizers and other additives typically used in dental materials. The filling material is used for the filing of root canals.",
    "claims": "1. A filling material for cavities and root canals comprising: a thermoplastic polymer having a bond strength when bonded to a root canal sealant equal to or greater than about 3 MPa; and optionally, a bioactive filler. 2. The filling material of claim 1 wherein the thermoplastic polymer comprises a biodegradable polymer. 3. The filling material of claim 1 wherein the thermoplastic polymer is present in an amount from about 10 percent to about 100 percent by weight. 4. The filling material of claim 1 wherein the bioactive filler is present in an amount of up to about 90 percent by weight. 5. The filling material of claim 1 wherein the biodegradable polymer comprises polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyethylene oxides, polyacrylates/methacrylates, polyalkylene succinates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, or combinations or mixtures thereof. 6. The filling material of claim 1 wherein the bioactive filler comprises bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, or mixtures thereof. 7. The filling material of claim 1 wherein the bioactive filler comprises bone chips, bone crystals, mineral fractions of bone or teeth, or mixtures thereof. 8. The filling material of claim 1 wherein the bioactive filler comprises particulate or fibrous filler in nanosize, microsize, macrosize form, or mixtures thereof. 9. The filling material of claim 1 further comprising a plasticizer. 10. The filling material of claim 9 wherein the plasticizer is present in an amount of up to about 90 percent by weight. 11. The filling material of claim 9 wherein the plasticizer comprises polyol, polyolfin or a mixture thereof. 12. The filling material of claim 1 further comprising an adhesive. 13. The filling material of claim 12 wherein the adhesive comprises acrylate, methacrylate, or a mixture thereof. 14. The filling material of claim 1 further comprising a polymeric resin, additional filler, pigment, dye, antibiotic, cariostatic, antibacterial, anti-inflammatory, biologically active or therapeutic material. 15. The filling material of claim 14 wherein the polymeric resin comprises polyamides, polyesters, polyolefins, polyimides, polyarylates, polyurethanes, vinyl esters epoxy-based materials, styrenes, styrene acrylonitriles, ABS polymers, polysulfones, polyacetals, polycarbonates, polyphenylene sulfides, polyarylsulfides, acrylonitrile-butadiene-styrene copolymers, polyurethane dimethacrylates, triethylene glycol dimethacrylate, polyethylene glycol dimethacrylate, urethane dimethacrylate, hexane diol dimethacrylate, polycarbonate dimethacrylate, the condensation product of bisphenol A and glycidyl methacrylate, 2,2′-bis [4-(3-methacryloxy-2-hydroxy propoxy)-phenyl]-propane and mixtures thereof. 16. The filling material of claim 14 wherein the additional filler comprises a radiopacifying filler. 17. The filing material of claim 14 wherein the additional filler comprises silica, silicate glass, quartz, zinc oxide, barium sulfate, barium silicate, strontium silicate, barium borosilicate, strontium borosilicate, borosilicate, lithium silicate, amorphous silica, bismuth compounds such as BiOCl, ammoniated or deammoniated calcium phosphate and alumina, zirconia, tin oxide, and titania, apatites, silica glass fillers, calcium silicate based fillers, hydroxyapatites, barium sulfate, bismuth subcarbonate or mixtures thereof. 18. The filling material of claim 14 wherein the additional filler comprises a fibrous filler. 19. The filling material of claim 18 wherein the fibrous filler comprises glass, ceramic, metal, carbon, graphite, or polymeric fibers. 20. The filling material of claim 19 wherein the polymeric fibers comprise cellulose, polyamide, aramid, polyester, polyaramid, acrylic, vinyl, modacrylic, polyolefin, polytetrafluorethylene, or mixtures thereof. 21. An appliance for applying a filling material to a root canal of a tooth comprising: a handle; a shaft; and filling material disposed on the shaft, wherein the filling material comprises a thermoplastic polymer having a bond strength when bonded to a root canal sealant equal to or greater than about 3 MPa; and optionally, a bioactive filler. 22. The appliance of claim 21 wherein the biodegradable thermoplastic polymer comprises polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyethylene oxides, polyacrylates/methacrylates, polyalkylene succinates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, or combinations or mixtures thereof. 23. The appliance of claim 21 wherein the bioactive filler comprises bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, or mixtures thereof. 24. An endodontic post comprising: a post section; and a tip section, wherein the tip section comprises a filling material, wherein the filling material comprises a thermoplastic polymer having a bond strength when bonded to a root canal sealant equal to or greater than about 3 MPa; and optionally, a bioactive filler. 25. The endodontic post of claim 24 wherein the tip section is integral to the post section. 26. The endodontic post of claim 24 wherein the post section is fabricated of metal, plastic, composite, ceramic, glass or polymeric material. 27. The endodontic post of claim 24 wherein the thermoplastic polymer comprises polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyethylene oxides, polyacrylates/methacrylates, polyalkylene succinates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, or combinations or mixtures thereof. 28. The endodontic post of claim 24 wherein the bioactive filler comprises bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, or mixtures thereof. 29. A method for restoring the root canal of a tooth comprising: preparing the root canal; applying a sealant into the root canal; inserting a filling material into the canal, wherein the filling material comprises a thermoplastic polymer and optionally, a bioactive filler, wherein the thermoplastic polymer bonds to the sealant at a bond strength equal to or greater than about 3 MPa. 30. The method of claim 29 wherein the step of preparing the root canal comprises applying an etchant to the walls of the root canal. 31. The method of claim 30 wherein the etchant is a self etchant. 32. The method of claim 30 wherein the self etchant comprises an adhesive material. 33. The method of claim 29 further comprising applying a bonding agent to the walls of the root canal after the root canal has been prepared. 34. The method of claim 33 wherein the bonding agent, sealant and filling material from a monoblock. 35. The method of claim 31 wherein the self-etchant, sealant and filling material form a monoblock. 36. The method of claim 29 wherein the filling material is softened prior to insertion into the canal. 37. The method of claim 29 wherein the filling material is removable. 38. The method of claim 29 wherein the filling material is dissolvable. 39. The method of claim 38 wherein the filling material is dissolvable in a dental solvent. 40. The method of claim 39 wherein the dental solvent comprises chloroform. 41. The method of claim 29 wherein the filing material comprises a single piece of material. 42. The method of claim 41 wherein the single piece of material is shaped and sized to fit snugly into the root canal. 43. The method of claim 29 wherein the filing material is shaped in the form of a cone. 44. The method of claim 29 further comprising, after inserting the filling material into the canal, heating and condensing the filling material to create more space, and inserting additional pieces of filling material into the space. 45. The method of claim 29 wherein the filling material is inserted into the root canal laterally and condensed and this step is repeated until the root canal is sufficiently filled. 46. The method of claim 29 wherein the filling material is inserted into the root canal vertically and condensed and this step is repeated until the root canal is sufficiently filled. 47. The method of claim 29 wherein the filling material comprises a single point of material that is inserted into the root canal to sufficiently fill the canal. 48. The method of claim 47 wherein the single point of material is disposed on a carrier and inserted into the canal via the carrier. 49. The method of claim 29 wherein the thermoplastic polymer comprises polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyethylene oxides, polyacrylates/methacrylates, polyalkylene succinates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, or combinations or mixtures thereof. 50. The method of claim 29 wherein the bioactive filler comprises bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, or mixtures thereof. 51. The method of claim 29 wherein the bioactive filler comprises bone chips, bone crystals, mineral fractions of bone or teeth, or mixtures thereof. 52. The method of claim 29 wherein the bioactive filler comprises particulate or fibrous filler in nanosize, microsize, macrosize form, or mixtures thereof. 53. The method of claim 29 wherein the filling material further comprises a plasticizer. 54. The method of claim 53 wherein root canal wherein the plasticizer comprises polyol, polyolefin or a mixture thereof. 55. The method of claim 29 wherein filling material further comprises an adhesive. 56. The method of claim 55 wherein the adhesive comprises acrylate, methacrylate, or a mixture thereof. 57. The method of claim 29 wherein filling material further comprises a polymeric resin, filler, pigment, dye, antibiotic, cariostatic, antibacterial, anti-inflammatory, biologically active or therapeutic material. 58. The method of claim 29 further comprising softening the filling material and injecting the filling material through a needle into the canal. 59. The method of claim 29 wherein the sealant comprises an acrylate, methacrylate, epoxy resin or mixtures thereof. 60. The method of claim 30 wherein the etchant comprises an organic acid or an inorganic acid. 61. The method of claim 58 wherein the organic acid comprises amino acid, acrylic acid, maleic acid, citric acid, ethylene diamine tetra acetic acid (EDTA), tartaric acid, itaconic acid, 5-sulfosalicylic acid, propionic, lactic acid, or derivatives or mixtures thereof. 62. The method of claim 60 wherein the inorganic acid comprises phosphoric acid, nitric acid, hydrochloric acid, sulfuric acid, or derivatives or mixtures thereof. 63. The method of claim 33 wherein the bonding agent comprises an acrylate or methacrylate resin. 64. A method for restoring the root canal of a tooth comprising: preparing the root canal; applying a sealant into the root canal; inserting a filling material into the canal, wherein the filling material comprises a thermoplastic polymer and optionally, a bioactive filler, wherein the thermoplastic polymer bonds to the sealant at a bond strength equal to or greater than about 3 MPa, wherein the thermoplastic polymer is a biodegradable polymer selected from the group consisting of polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyethylene oxides, polyacrylates/methacrylates, polyalkylene succinates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, and combinations thereof; wherein the bioactive filler is selected from the group consisting of bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, and mixtures thereof; and wherein the step of preparing the root canal comprises applying an etchant to the walls of the root canal. 65. A filling material for cavities and root canals comprising: a thermoplastic polymer having a bond strength when bonded to a root canal sealant equal to or greater than about 3 MPa; and optionally, a bioactive filler; wherein the thermoplastic polymer is a biodegradable polymer selected from the group consisting of polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyethylene oxides, polyacrylates/methacrylates, polyalkylene succinates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, and combinations thereof; and wherein the bioactive filler is selected from the group consisting of bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, and mixtures thereof. 66. A filling material for cavities and root canals comprising: a thermoplastic polymer; wherein the filling material has a bacterial leakage rate of 13% or less when testing leakage over a thirty day period using a split chamber microbial leakage model; wherein the split chamber microbial leakage model comprises an upper chamber, a lower chamber and an obturated canal disposed between and connected to the upper and lower chamber; wherein the upper chamber comprises bacteria; wherein the lower chamber comprises broth; and whereby leakage is detected by a change in the original color of the broth in the lower chamber. 67. The filling material of claim 66 wherein the presence of bacteria in the lower chamber changes the color of the broth. 68. The filling material of claim 66 wherein the bacteria comprises S. mutans or S. faecalis. 69. The filling material of claim 66 wherein the broth comprises Basal Broth. 70. The filling material of claim 69 wherein the broth further comprises a pH indicator. 71. The filling material of claim 70 wherein the ph indicator comprises Phenol Red. 72. The filling material of claim 66 wherein the original color is red and is changed to yellow upon leakage. 73. The filling material of claim 66 wherein the leakage rate is about 6.7% or less. 74. The filling material of claim 66 wherein the leakage rate is based on a test sample of 15 teeth. 75. A filling material for cavities and root canals comprising: a thermoplastic polymer; wherein the filling material has a bacterial leakage rate of 13% or less when testing leakage over a thirty day period using a split chamber microbial leakage model; wherein the split chamber microbial leakage model comprises an upper chamber, a lower chamber and an obturated canal disposed between and connected to the upper and lower chamber; wherein the upper chamber comprises bacteria; wherein the lower chamber comprises broth; and whereby leakage is detected by a change in the pH of the broth in the lower chamber. 76. The filling material of claim 74 wherein the leakage rate is about 6.7% or less. 77. The filling material of claim 74 wherein the leakage rate is based on a test sample of 15 teeth. 78. The filling material of claim 1 wherein the bond strength between the filling material and the root canal sealant is measured by: producing disks of filling material; leaving one side of the disks exposed; applying a cement sealant to the exposed side of the disks; allowing the sealant to set; debonding the samples with a push shear mold; recording the maximum load at which the cement cylinders break from the sample surfaces; and calculating the bond strengths using the load divided by the contact surface area of the cement cylinder. 79. The filling material of claim 78 wherein a Bencor test device is used to debond the samples. 80. The filling material of claim 78 wherein the disks are mounted in a mounting material before the application of a cement sealant to an exposed side. 81. The filling of material of claim 78 wherein gelatin capsules are applied to the cement sealant to hold the cement sealant under a load of 500 grams. 82. The filling material of claim 78 wherein producing disks of filling material comprises softening the filling material and placing it in to steel molds to produce sample disks having a diameter of 15 mm and a thickness of 1.2 mm. 83. The filling material of claim 78 wherein the Bencor test device comprises a crosshead for debonding the samples and the speed of the crosshead is about 0.02 in/minute.",
    "background": "<SOH> BACKGROUND OF THE INVENTION  <EOH>Endodontics or root canal therapy is that branch of dentistry that deals with the diseases of the dental pulp and associated tissues. One aspect of endodontics comprises the treatment of infected root canals, the removal of diseased pulp tissues, followed by the biomechanical modification and the subsequent filling of the pulp cavity (root canal). Root canal therapy is generally indicated for teeth having sound external structures but having diseased, dead or dying pulp tissues. Such teeth may or may not generally possess intact enamel and dentin and are satisfactorily engaged with bony tissue. In such teeth, the pulp tissue and excised portions of the root should be replaced by a biocompatible substitute. One technique for the preparation of a root canal involves creating a coronal access opening with a conventional dental drill. A tool is used for gross removal of pulp material from the root canal through the coronal access opening. The void formed is enlarged with reamers and/or files to result in a fully excavated cavity. Debris is removed from this cavity by flushing and the cavity is cleansed to remove all diseased tissue. This process, while essential, results in a root canal that is weakened and susceptible to fracture. Following chemical antisepsis, the excavated canal is ready for filling. A basic method involves inserting a filling cone into a root canal and cementing therein to obturate the canal. The common root canal filling cone material is made from gutta-percha. Lateral condensation is a method in which several filling cones, a primary cone and auxiliary cones, are inserted into a root canal. The primary cone is inserted and cemented to the seat of the root canal. Using a tapered spreader, the primary cone is then squeezed against the side of the root canal and a second cone is inserted and cemented into place. This process is continued until the root canal is completely obturated which can require up to 10 to 15 filling cones. Vertical condensation of warm or hot gutta-percha is yet another method of sealing root canals. After cementing a primary cone short of the apex of the root canal, heat application is alternated with a series of smaller and smaller pluggers until the gutta-percha is moved to the apex. This is often possible when the smallest plugger approaches the apex of the tooth within 3 to 5 millimeters. The space is then backfilled. Lateral canals are packed and sealed as a consequence of lateral expansion of a wave of heated gutta-percha. Alternatively, small segments of gutta-percha can be used in this method that are inserted into the root canal, heated in order that they can adhere to one another and each backfilled one at a time until the root canal is filled. All three of these methods, the single filling cone, lateral condensation and vertical condensation apply root canal cement or sealer around the individual cones or in between segments as a binding agent. Another method employs an injection gun that injects warm or hot gutta-percha filling material into a root canal. The injector initially places heated gutta-percha at the apical area of the root canal through a needle-like canula tip and fills the gutta-percha into any surrounding voids/spaces under pressure or at the seat of the root canal which is then condensed with a plugger into the root tip. The injector then backfills the root canal by injecting additional gutta-percha into the root canal until it is obturated. A similar method involves heating gutta-percha on a flexible metal or plastic carrier used to insert the gutta-percha into the root canal. The carrier may be a solid rod, or a hollow rod, situated in the center of a master cone. The rod is connected to a handle which may be removed by slipping it out of the hollow rod, or cutting it off if it is a solid rod. Most of the current methods employed in obturating a canal use a gutta-percha material that is inert in nature and will not be absorbed or degraded by the living tissue if the root canal is overfilled and extends beyond the apex. It has been a challenge for dentists to control the exact amount of the material within the border of the root canal to avoid overfilling. The cold core of gutta-percha is not malleable so that it cannot be molded to the canal walls, resulting in poor adherence. In addition, when heated gutta-percha cools to body temperature in the root, a uniform contraction takes place further reducing adherence to the walls of the canal. Moreover, gutta-percha material is a polyisoprene rubber material in nature, which does not have the capability to bond to most dental materials, especially when the root canal sealer is a polymer-based material. Due to poor adherence and bonding, existing bacteria in the root canal can multiply or leakage may result, causing bacteria to enter the canal from the mouth, which can lead to the persistence of an infection or other complications. Gutta-percha exhibits poor strength and brittleness. Dental gutta-percha points/cones tend to break in harsh conditions, e.g., sharply curved root canals, tight spaces during a root canal treatment, and the like. It is desirable to provide a root canal filling material that bonds easily to sealants. It is preferable that the root canal filling material have proper strength and flexibility. It would be advantageous if the root canal filling material could be retrievable or dissolvable. It would be highly advantageous if the root canal filling material could reduce or eliminate bacterial leakage. It would be beneficial if the cavity filling material and root canal filling material could be bioactive. It would be further advantageous if the root filling material strengthened the root.",
    "summary": "<SOH> SUMMARY OF THE INVENTION  <EOH>These and other objects and advantages are accomplished by the filling material of the present invention comprising a thermoplastic polymer. The thermoplastic polymer is preferably a biodegradable polymer. A bioactive substance may be combined with the biodegradable thermoplastic polymer. The thermoplastic polymer acts as a matrix for the bioactive substance. The composition may include other polymeric resins, fillers, plasticizers and other additives typically used in dental filler materials. The filling material is used for the filling of dental cavities or root canals. The material may be placed in a root canal that has been opened to a predetermined dimension by use of endodontic files, to seal the apical end. If necessary, the filling material can be compacted toward the apex, while it is still in the softened state, to ensure the apex is adequately sealed. If, by chance, the filling material is pushed slightly past the apex, or seeps through the apex, or comes in contact with fluids in the mouth, the biodegradable material will disintegrate or break down and be absorbed or partially absorbed by the surrounding living tissues. If a bioactive substance is present in the filling material, it will react with the tissue in the mouth, mending and/or growing tissue to fill in any gaps or openings.",
    "full_description": "CROSS-REFERENCE TO RELATED APPLICATIONS This application is a continuation-in-part of application Ser. No. 10/304,371, filed Nov. 26, 2002, which is a continuation-in-part of application Ser. No. 10/279,609 filed Oct. 24, 2002, which claims priority to provisional application Ser. No. 60/336,500 filed Oct. 24, 2001. FIELD OF THE INVENTION This invention relates to filling materials for use in filling dental cavities and for root canal treatments. BACKGROUND OF THE INVENTION Endodontics or root canal therapy is that branch of dentistry that deals with the diseases of the dental pulp and associated tissues. One aspect of endodontics comprises the treatment of infected root canals, the removal of diseased pulp tissues, followed by the biomechanical modification and the subsequent filling of the pulp cavity (root canal). Root canal therapy is generally indicated for teeth having sound external structures but having diseased, dead or dying pulp tissues. Such teeth may or may not generally possess intact enamel and dentin and are satisfactorily engaged with bony tissue. In such teeth, the pulp tissue and excised portions of the root should be replaced by a biocompatible substitute. One technique for the preparation of a root canal involves creating a coronal access opening with a conventional dental drill. A tool is used for gross removal of pulp material from the root canal through the coronal access opening. The void formed is enlarged with reamers and/or files to result in a fully excavated cavity. Debris is removed from this cavity by flushing and the cavity is cleansed to remove all diseased tissue. This process, while essential, results in a root canal that is weakened and susceptible to fracture. Following chemical antisepsis, the excavated canal is ready for filling. A basic method involves inserting a filling cone into a root canal and cementing therein to obturate the canal. The common root canal filling cone material is made from gutta-percha. Lateral condensation is a method in which several filling cones, a primary cone and auxiliary cones, are inserted into a root canal. The primary cone is inserted and cemented to the seat of the root canal. Using a tapered spreader, the primary cone is then squeezed against the side of the root canal and a second cone is inserted and cemented into place. This process is continued until the root canal is completely obturated which can require up to 10 to 15 filling cones. Vertical condensation of warm or hot gutta-percha is yet another method of sealing root canals. After cementing a primary cone short of the apex of the root canal, heat application is alternated with a series of smaller and smaller pluggers until the gutta-percha is moved to the apex. This is often possible when the smallest plugger approaches the apex of the tooth within 3 to 5 millimeters. The space is then backfilled. Lateral canals are packed and sealed as a consequence of lateral expansion of a wave of heated gutta-percha. Alternatively, small segments of gutta-percha can be used in this method that are inserted into the root canal, heated in order that they can adhere to one another and each backfilled one at a time until the root canal is filled. All three of these methods, the single filling cone, lateral condensation and vertical condensation apply root canal cement or sealer around the individual cones or in between segments as a binding agent. Another method employs an injection gun that injects warm or hot gutta-percha filling material into a root canal. The injector initially places heated gutta-percha at the apical area of the root canal through a needle-like canula tip and fills the gutta-percha into any surrounding voids/spaces under pressure or at the seat of the root canal which is then condensed with a plugger into the root tip. The injector then backfills the root canal by injecting additional gutta-percha into the root canal until it is obturated. A similar method involves heating gutta-percha on a flexible metal or plastic carrier used to insert the gutta-percha into the root canal. The carrier may be a solid rod, or a hollow rod, situated in the center of a master cone. The rod is connected to a handle which may be removed by slipping it out of the hollow rod, or cutting it off if it is a solid rod. Most of the current methods employed in obturating a canal use a gutta-percha material that is inert in nature and will not be absorbed or degraded by the living tissue if the root canal is overfilled and extends beyond the apex. It has been a challenge for dentists to control the exact amount of the material within the border of the root canal to avoid overfilling. The cold core of gutta-percha is not malleable so that it cannot be molded to the canal walls, resulting in poor adherence. In addition, when heated gutta-percha cools to body temperature in the root, a uniform contraction takes place further reducing adherence to the walls of the canal. Moreover, gutta-percha material is a polyisoprene rubber material in nature, which does not have the capability to bond to most dental materials, especially when the root canal sealer is a polymer-based material. Due to poor adherence and bonding, existing bacteria in the root canal can multiply or leakage may result, causing bacteria to enter the canal from the mouth, which can lead to the persistence of an infection or other complications. Gutta-percha exhibits poor strength and brittleness. Dental gutta-percha points/cones tend to break in harsh conditions, e.g., sharply curved root canals, tight spaces during a root canal treatment, and the like. It is desirable to provide a root canal filling material that bonds easily to sealants. It is preferable that the root canal filling material have proper strength and flexibility. It would be advantageous if the root canal filling material could be retrievable or dissolvable. It would be highly advantageous if the root canal filling material could reduce or eliminate bacterial leakage. It would be beneficial if the cavity filling material and root canal filling material could be bioactive. It would be further advantageous if the root filling material strengthened the root. SUMMARY OF THE INVENTION These and other objects and advantages are accomplished by the filling material of the present invention comprising a thermoplastic polymer. The thermoplastic polymer is preferably a biodegradable polymer. A bioactive substance may be combined with the biodegradable thermoplastic polymer. The thermoplastic polymer acts as a matrix for the bioactive substance. The composition may include other polymeric resins, fillers, plasticizers and other additives typically used in dental filler materials. The filling material is used for the filling of dental cavities or root canals. The material may be placed in a root canal that has been opened to a predetermined dimension by use of endodontic files, to seal the apical end. If necessary, the filling material can be compacted toward the apex, while it is still in the softened state, to ensure the apex is adequately sealed. If, by chance, the filling material is pushed slightly past the apex, or seeps through the apex, or comes in contact with fluids in the mouth, the biodegradable material will disintegrate or break down and be absorbed or partially absorbed by the surrounding living tissues. If a bioactive substance is present in the filling material, it will react with the tissue in the mouth, mending and/or growing tissue to fill in any gaps or openings. BRIEF DESCRIPTION OF THE DRAWINGS Features of the present invention are disclosed in the accompanying drawings, wherein similar reference characters denote similar elements throughout the several views, and wherein: FIG. 1 is a graph showing bacterial leakage of test samples after 30 days; FIG. 2 is a graph showing bacterial leakage of test samples after 30 days; FIG. 3 is an elevational view of a sample placed in an Instron machine for fracture testing; FIG. 4 is an elevational view of the sample shown in FIG. 3; FIG. 5 is an elevational view of an appliance having a filling material thereon; FIG. 6 is an elevational view of a post as an alternate carrier in accordance with the invention; FIG. 7 is an elevational view of an alternate embodiment of an alternate carrier in accordance with the invention; and FIG. 8 is an elevational view of yet another alternative embodiment of the invention. DESCRIPTION OF THE INVENTION As will be appreciated, the present invention provides a filling material for root canals and cavities comprising a thermoplastic polymer. The thermoplastic polymer may be biodegradable. A bioactive substance may be combined with the biodegradable thermoplastic polymer. The thermoplastic polymer acts as a matrix for the bioactive substance. The composition may include other polymeric resins, fillers, plasticizers and other additives typically used in dental filler materials including, but not limited to, antibiotic, cariostatic, antibacterial, or other anti-inflammatory, biologically active, therapeutic materials, pigments and dyes. The composition may also be useful for root canal sealants, implants and pulp capping materials. It is important that the thermoplastic polymer bonds well to the root canal sealant that is applied to the root canal. The bond strength of the thermoplastic polymer to the root canal sealant is equal to or greater than about 3 MPa, and preferably equal to or greater than about 4 MPa and most preferably equal to or greater than about 5 MPa. Suitable thermoplastic polymers for use as the matrix are pharmaceutically compatible. It is preferred that the polymers are biodegradable by cellular action and/or by the action of body fluids. Examples of appropriate thermoplastic polymers include but are not limited to polylactides, polyglycolides, polycaprolactones, polyanhydrides, polyamides, polyurethanes, polyesteramides, polyorthoesters, polydioxanones, polyacetals, polyketals, polycarbonates, polyorthocarbonates, polyphosphazenes, polyhydroxybutyrates, polyhydroxyvalerates, polyalkylene oxalates, polyalkylene succinates, polyethylene oxides, polyacrylates/methacrylates, poly(malic acid) polymers, polymaleic anhydrides, poly(methylvinyl) ethers, poly(amino acids), chitin, chitosan, and copolymers, terpolymers, or combinations or mixtures of the above materials. Preferred materials are the polylactides, polyglycolides, polycaprolactones, and copolymers thereof. These polymers can be used to advantage in the polymer system in part because they show excellent biocompatibility. They produce little, if any, tissue irritation, inflammation, necrosis, or toxicity. In the presence of water, these polymers produce lactic, glycolic, and hydroxycaproic acid, respectively, which are readily metabolized by the body. The polylactides and polycaprolactones can also incorporate glycolide monomer to enhance the resulting polymer's degradation. The biodegradable thermoplastic polymer may be present in an amount from about 10 to about 100 percent by weight. The bioactive material may include any substance or metabolic precursor thereof, which is capable of promoting growth and survival of cells, tissues, and bone. Suitable bone growth promoting substances include but are not limited to bioglass, calcium phosphate, Portland cement, hydroxyapatite, tricalcium phosphate, a di- or polyphosphonic acid, an anti-estrogen, a sodium fluoride preparation, a substance having a phosphate to calcium ratio similar to natural bone, calcium hydroxide, other suitable calcium-containing compounds, and the like. A bone growth promoting substance may be in the form of a particulate or fiber filler in nano, micro or macro form, or mixtures thereof, bone chips, bone crystals or mineral fractions of bone and/or teeth, a synthetic hydroxyapatite, or other suitable form. The bioactive filler may be present in an amount of up to about 90 percent by weight. The biodegradable thermoplastic polymers should have melting temperatures of about 50 to about 300° C., preferably about 60 to about 250° C., and most preferably about 70 to about 200° C. The melting temperature of the polymers in these ranges facilitates the process of compounding the thermoplastic polymer with bioactive inorganic particulates and other additives. Furthermore, the melting temperature range of the polymers also facilitates the application of the filling material made from the compounds into a root canal with conventional accessible heating methods. Examples of additional polymeric resins useful in the filling composition include, but are not limited to, polyamides, polyester, polyolefins, polyimides, polyarylates, polyurethanes, vinyl esters or epoxy-based materials, styrenes, styrene acrylonitriles, ABS polymers, polysulfones, polyacetals, polycarbonates, polyphenylene sulfides, polyarylsulfides, acrylonitrile-butadiene-styrene copolymers, polyurethane dimethacrylates (hereinafter abbreviated to “UDMA”, triethylene glycol dimethacrylate (hereinafter abbreviated “TEGDMA”), polyethylene glycol dimethacrylate (hereinafter abbreviated “PEGDMA”), urethane dimethacrylate (hereinafter abbreviated “UDMA”), hexane diol dimethacrylate (hereinafter abbreviated “1,6 HDDMA”) and polycarbonate dimethacrylate (hereinafter abbreviated “PCDMA”) and the like. Among the examples given, the resins containing surface functional groups such as acrylate/methacrylate, epoxy, hydroxyl and others are preferred since they not only serve as plasticizers for the compositions but as adhesive components as well for promoting the bonding between the compound and a sealant. Preferred polymeric matrix materials include those based on acrylic and methacrylic monomers, for example those disclosed in U.S. Pat. Nos. 3,066,112, 3,179,623, and 3,194,784 to Bowen; U.S. Pat. Nos. 3,751,399 and 3,926,906 to Lee et al., and commonly assigned U.S. Pat. No. 5,276,068 to Waknine (which are herein incorporated by reference). An especially preferred methacrylate monomer is the condensation product of bisphenol A and glycidyl methacrylate, 2,2′-bis [4-(3-methacryloxy-2-hydroxy propoxy)-phenyl]-propane (hereinafter abbreviated “BIS-GMA”). Other fillers which may be used in addition to the bioactive material include inorganic and organic particulates and fibrous fillers known in the art including, but are not limited to, silica, silicate glass, quartz, zinc oxide, barium sulfate, barium silicate, strontium silicate, barium borosilicate, strontium borosilicate, borosilicate, lithium silicate, amorphous silica, bismuth compounds such as BiOCl, ammoniated or deammoniated calcium phosphate and alumina, zirconia, tin oxide, and titania, among other conventional fillers such as those disclosed in commonly assigned U.S. Pat. Nos. 4,544,359 and 4,547,531 to Waknine (which are incorporated herein by reference). Some of the fillers also act as radiopaque/high refractive index materials, such as apatites, silica glass fillers, calcium silicate based fillers, hydroxyapatites, barium sulfate, bismuth subcarbonate, ytterbium oxide, ytterbium fluoride, ytterbium iodine, bismuth oxide, bismuth fluoride, barium oxide, and tantalum oxide. Fibrous fillers also include, but are not limited to, include glass, ceramic, metal, carbon, graphite, polymeric such as cellulose, polyamide, aramid, polyester, polyaramid, acrylic, vinyl and modacrylic, polyolefin, polytetrafluorethylene, mixtures thereof, as well as other fibers known in the art. The fibers may be of uniform or random length, unidirectional or multidirectional, or randomly dispersed, and may be as short as about 3 to about 4 millimeters (mm) or shorter. The fibers may also be in the form of fabric as set forth in U.S. Patent No. 6,186,791, or as possible reinforcing fibers, as used in U.S. Pat. Nos. 4,717,341 and 4,894,012 to Goldberg et al., all of which are hereby incorporated by reference. Examples of plasticizers useful in the filling composition include, but are not limited to, polyol, polyolfin or a mixture thereof. The plasticizer can be incorporated into the composition in the range of up to about 40 percent by weight, preferably up to about 30 percent by weight, and most preferably up to about 20 percent by weight. In a method for restoring a root canal in accordance herein, the root canal is prepared by the dentist. This can involve inserting endodontic files or reamers into the canal to remove pulp, necrotic tissue, organic debris, and other potential irritants. Thereafter, an etchant is applied to the root canal wall. Examples of etchants include, but are not limited to, organic acids or their derivatives such as an ethylene diamine tetra acetic acid (EDTA) solution, amino acid, acrylic acid, maleic acid, citric acid, tartaric acid, itaconic acid, 5-sulfosalicylic acid, propionic acid, lactic acid and the like; inorganic acids such as phosphoric acid, hydrochloric acid, sulfuric acid, nitric acid, and the like. Useful etchants for the process herein disclosed are described in commonly assigned U.S. Pat. No. 6,537,563, which is hereby incorporated by reference. In general, the commercial dental etchants used for dentin surface conditioning/etching are all suitable for root canal etching purposes. Commercially available etching gels suitable for this purpose are available from Pentron Clinical Technologies, LLC as 10% phosphoric acid etching gel and 37% phosphoric acid etching gel. Preferably, the etchant is a self-etch bonding agent such as described in commonly owned, copending U.S. Application No. 20020019456, which is hereby incorporated by reference. A commercially available self-etch primer useful herein is NanoBond™ self-etch primer from Pentron Clinical Technologies, LLC. Other examples of commercially available self-etch primer/adhesives are SE Bond™ available from Kuraray, Prompt L-Pop™ available from 3M/ESPE company, and iBond™ available from Kulzer. Alternatively, if the etchant does not include an adhesive, a bonding agent may further be applied to the walls of the root canal. Examples of bonding materials include, but are not limited to, dental acrylate/methacrylate based resin adhesives. Commercially available bonding agents include, but are not limited to, Bond-It® and Bond-1® bonding agents from Pentron Clinical Technologies, LLC, All Bond 2™ and One Step™ from Bisco, Prime&Bond™ from Dentsply, ScotchBond™ from 3M, and PermaQuik™ from Ultradent. Thereafter, a sealant is applied into the root canal. Examples of sealants include, but are not limited to, acrylate/methacrylate resin based root canal sealants, epoxy resin based sealants, and the like and the sealants disclosed in commonly assigned U.S. Pat. No. 6,455,608, which is hereby incorporated by reference. Commercially available sealants include FiberFill™ root canal sealant from Pentron, AH-26™ from LD Caulk/Dentsply and EndoRez™ from Ultradent. After the sealant is applied, the filling material is inserted into the canal. It may applied in a variety of ways including, but not limited to, lateral condensation, vertical condensation of soft material, and single points of material either inserted individually or applied to a carrier and inserted into the canal via the carrier. The canal is then filled with a filling material that may or may not include a post to provide added support for the remaining tooth structure. An artificial crown, direct or indirect restoration, fixed-partial denture abutment, etc. can then be placed over the tooth to complete the tooth restoration. The materials and process described herein provide superior sealing and filling of the root canal. The materials used to seal and fill the root canal form a monoblock of material that is bonded to the wall of the root canal to reduce or eliminate leakage of bacteria into the canal. Moreover, the filling materials described herein are easily removable from the root canal. One example of removing the filling material from the root is by dissolving the material in a dental solvent such as chloroform. Leakage tests were performed over a thirty day period on samples of teeth using various forms of filling materials. A split chamber microbial leakage model was used wherein S. mutans or S. faecalis (see groups below), which were placed in the upper chamber, could reach the lower chamber only through the obturated canal. A lower chamber consisted of 15 ml of Basal Broth with Phenol Red indicator to which 1% sucrose was added. The specimens were checked every 24 hours over a period of 30 days for a change in the color of the broth or of the pH indicator from red to yellow (metabolism as acid production), which indicated bacterial leakage. The average rate of leakage of bacteria was compared between all groups over 30 days by using Cochran-Mantel-Haenszel row means score statistics. Leakage was assessed every day for 30 days. The groups tested were as follows. Group 1 consisted of ten teeth that were filled with gutta-percha, but without the use of a sealer (Positive Control). Group 2 consisted of ten teeth prepared as in Group 1, but the entire system was sealed to test its ability to stop bacteria from moving through it (Negative Control). Group 3 consisted of fifteen teeth having AH26 sealant applied and then filled laterally with gutta-percha and condensed (LT-AH26). Group 4 consisted of fifteen teeth having AH26 sealant applied and then filled vertically with gutta-percha and condensed (VT-AH26). Group 5 consisted of fifteen teeth having AH26 sealant applied and then filled with Obtura soft gutta-percha (Obtura-AH26). Group 6 consisted of fifteen teeth prepared and etched with a self etching primer, followed by application of a root canal sealant, followed by the lateral insertion of resin material (resin percha) in accordance with the invention (LT Resin Percha). Group 7 consisted of fifteen teeth prepared and etched with a self etching primer, followed by application of a root canal sealant, followed by the vertical insertion of resin material (resin percha) in accordance with the invention (VT Resin Percha). Groups 8 and 9 were identical to Groups 6 and 7, respectively, except that unlike Groups 1 to 7 that used S. mutans bacteria, Groups 8 and 9 used S. faecalis bacteria. The results are shown in Table 1 below. TABLE 1 NUMBER OF LEAKAGE OF TEETH AFTER NUMBER OF DAYS GROUP TEETH 1 day 3 days 6 days 9 days 12 days 15 days 18 days 21 days 24 days 27 days 30 days 1 10 10 10 10 10 10 10 10 10 10 10 10 Positive Control 2 10 0 0 0 0 0 0 0 0 0 0 0 Negative Control 3 15 0 0 6 10 12 13 13 13 13 13 13 LT-AH26 4 15 0 0 4 8 10 10 10 11 11 11 11 VT-AH26 5 15 0 0 8 10 14 14 14 14 14 14 14 Obtura AH26 6 15 0 0 0 0 1 1 1 1 2 2 2 LT Resin Percha 7 15 0 0 0 0 1 1 2 2 2 2 2 VT Resin Percha 8 15 0 1 1 1 1 1 2 2 2 2 2 LT Resin Percha 9 15 0 0 1 1 1 1 1 1 1 1 1 VT Resin Percha As shown in Table 1, the materials of the invention used in Examples 6-9, show leakage in only 1 or 2 of 15 teeth in a period of 30 days compared with conventional materials used in Examples 3 through 5, which showed leakage of most of the teeth over the same time period. FIGS. 1 and 2 are graphs showing in-vitro leakage for Strep. mutans and Enterococcus faecalis, respectively, for test groups of 15 teeth using the test described above. In FIG. 1, PC, NC, L-GP, V-GP, L-RP and V-RP refer to positive control, negative control, lateral-gutta-percha, vertical-gutta-percha, lateral-resin percha and vertical-resin percha, respectively. The resin percha used herein comprises Composition C as set forth in Table 3 below. Consistent with Table 1 above, the graph in FIG. 1 shows the positive control tooth having filling material without a cement (PC) having leakage in all 15 teeth. The negative control, which is a normal tooth, showed no leakage after 30 days. The gutta-percha inserted both laterally and vertically, show high leakage rates of 13 and 14 teeth, respectively, after 30 days. The resin percha of the invention showed very low leakage of only 2 teeth after 30 days. The graph in FIG. 2 representing leakage of Enterococcus faecalis in test groups of 15 teeth is also consistent with Table 1 and FIG. 1. As expected, the positive control shows leakage of all 15 teeth and the negative control shows no leakage. The laterally placed and vertically placed resin percha show low leakage of only 2 teeth and 1 tooth, respectively. The following examples illustrate the invention. EXAMPLE 1 Extracted central incisor teeth were prepared with root canal files to standard sizes so that the remaining walls of the teeth were of a similar size. The roots were restored as follows Group 1 (15 teeth)—positive control—no root canal filling placed. Group 2 (15 teeth)—root canals filled with lateral condensation gutta-percha and AH26 sealer. Group 3 (15 teeth)—root canals filled with vertical condensation gutta-percha and AH26 root canal sealer. Group 4 (15 teeth)—root canals walls were prepared with the self etch primer, filled with root canal sealant sealer and then filled vertically with resin percha in accordance with the invention. All roots were placed in a container with 100% humidity for 2 weeks until the strength tests were performed. After two weeks the teeth were mounted into a plastic ring with commercial resin to a level that left 8 mm of root above the resin. The rings were mounted into an Instron machine in which a ball attachment was-placed so as to create a wedge-like force along the long axis of the tooth when activated. Reference is hereby made to FIGS. 3 and 4, which show the placement of the samples in the Instron machine. When the correct position of the ball on the tooth was confirmed, the Instron machine was activated so that a slowly increasing force was applied to the root until fracture occurred. The resistance to fracture (fracture force) for each tooth in each group was recorded and the mean fracture values for the groups are compared in Table 2 below. TABLE 2 Group 1 - Control 360 lbs Group 2 - 331 lbs GP Lateral Group 3 - 380 lbs GP Vertical Group 4 - 460 lbs RP vertical As can be seen from the results in Table 2, the groups in which gutta-percha was used (Groups 2 and 3) were no different from the control group (Group 1) having no root canal filling. The resin percha group (Group 4) showed a 22% increase in strength over the control (Group 1). EXAMPLE 2 A composition comprising polycaprolactone available from Union Carbide in an amount of about 40%, a bioactive glass having a composition similar to Bioglass™ (available from by U.S. Biomaterials) in an amount of about 30%, USP grade zinc oxide in an amount of about 20% and barium sulfate as a radio-opacifying agent in an amount of about 10% was manufactured. The method of forming the composition involved heating the polycaprolactone at about 70° C. to a softened state. The remaining ingredients were then added and mixed under the action of kneading, pressing, or mixing to blend into the polycaprolactone completely to form a homogenous dough. The formed compound was then ready for application to the carrier device. EXAMPLE 3 A composition comprising polycaprolactone in an amount of about 30%, caprolactone (methacryloxy)ethyl ester (CMEE) in an amount of about 10%, tricalcium phosphate in an amount of about 30%, and zirconium oxide in an amount of about 10% was manufactured. The method of forming the composition involved heating the polycaprolactone (available from Union Carbide) at about 70° C. to a softened state. The remaining ingredients were then added and mixed under the action of kneading, pressing, or mixing to blend into the polycaprolactone completely to form a homogenous dough. The formed compound was then ready for application to the carrier device. The following Table 3 sets forth examples of the filling material compositions made similar to the methods described in Examples 2 and 3 above. TABLE 3 Composition WEIGHT (%) A B C D E P767* 40 30 21 25 P787* 9 27 PEGDMA(400) 5 8 UDMA 10 CMEE** 10 Bioactive glass 30 10 21.5 30 ZnO 20 10 21.5 25 25 BaSO4 20 22 20 BiOCl 10 Ca(OH)2 20 Ca3(PO4)2 20 ZrO2 10 *P767 and P787 are polycaprolactone resins sold under the trade name of TONE ™ POLYMER by Dow Chemical Co. **CMEE is caprolactone (methacryloxy) ethyl ester The compositions were then prepared for bonding strength tests as follows: Sample Preparation for Bonding Tests The compositions from Table 3 above were softened at about 80° C. in a convection oven. While the materials were at a workable consistency, they were placed in 15 mm diameter and 1.2 mm thickness steel molds between two glass slides and were cooled down to bench temperature. Sample disks were formed and the glass slides and molds were removed. Some trimming was necessary to remove the flashes from the edge. Five discs were prepared for each test material. The sample disks were then mounted into a cold-cured acrylic mounting material in a splitable cylindrical TEFLON™ mold of a 20 mm diameter and about a 30 mm height, leaving one side of the disk exposed. A two-component self curable A2 shaded Cement-It™ C&B Universal Cement (Pentron Corp., Wallingford, Conn.), which is a methacrylate resin cement, was used to make a composite button and was bonded directly to the exposed sample surfaces. Number five (#5) Gelatin capsules (Torpac Inc. NJ) were used to load the cement and were placed directly onto the surfaces under a load of 500 grams on a Bencor testing device (Denville Engineering, CA) until the cement hardened. The cement has a setting time of approximately 4 minutes after the two components are mixed. After one hour of bench setting, the bonded samples were debonded with a push shear mold in a Bencor test device under a crosshead speed of 0.02 in/minute. The maximum load at which the cement cylinders broke from the sample surfaces was recorded. Bonding strengths were calculated using the load divided by the contact surface area of the cement cylinder. The following Table 4 sets forth bonding strengths of the filling compositions in Table 3 along with a gutta-percha composition for comparison. TABLE 4 Compositions Bond Strength, MPa (S.D.) A 3.2 (1.1) B 5.5 (2.3) C 6.5 (1.9) D 6.8 (0.7) E 6.8 (1.2) Gutta-percha Control* 0 (Samples all failed before testing) *The control is a dental gutta-percha material available from Endodent, Inc. Duart, CA Transverse Deflection Tests To test the flexibility of the compositions herein, a testing apparatus for the transverse deflection test as described in ADA specification Number 12 for Denture Base Polymers was adopted for the test. The test samples were made into bars of 50×3×3 mm in a TEFLON splitable mold while the materials were at a soft stage. A 500 gram weight was applied onto the center of the test sample through the loading nose. The span between the two supports was 30 mm. The still load was removed after one minute (if the sample had not broken during the standing period) and the maximum deflection distance was measured and recorded. Three test samples were run for each test material. The test results are shown in Table 5. TABLE 5 Maximum Deflection Time of Test Samples Compositions Distance (mm) withstanding the load) A 6-8 Full minute without break C 7-9 Full minute without break Gutta-percha 1-3 1-2 seconds (Broke almost Control instantly after applied the load) The results of the inventive materials are shown to have superior results over the gutta-percha material. The bioactive material can be miscible in the polymer to provide a homogeneous mixture with the polymer, or insoluble in the polymer to form a suspension or dispersion with the polymer. The filling material may be in the form of a cone to be inserted into a canal. The cone may be inserted into the canal using a file or similar instrument, or it may be attached to a file, shaft or similar carrier which instrument is then inserted into the canal with the cone thereon. After insertion, the carrier is removed or the excess of the cone is cut off as in a conventional gutta-percha cone application from the root canal. Alternatively, the material may be softened and compacted toward the apex, while it is still in the softened state, to ensure the apex is adequately sealed. This may be done by a backfilling technique whereby, for example, the material is heated and injected into the canal using a device having a needle, such as the Obtura II device available from Obtura/Spartan, Fenton, Mo. If, by chance, the filling material is pushed slightly past the apex, or seeps through the apex, or comes in contact with fluids in the mouth, the biodegradable material will disintegrate or break down and be absorbed or partially absorbed by the surrounding living tissues and the bioactive substance present in the filling material will react with tissue in the mouth, mending and/or growing tissue to fill any gaps or openings. Commonly assigned U.S. Pat. No. 6,455,608 is directed to dental compositions comprising degradable polymers for use as root canal sealants, implants and pulp capping materials and is hereby incorporated by reference. The compositions use polymerizable and degradable macromonomers to provide precursors for forming biodegradable and biocompatible polymers upon a chemical reaction, which advantageously allow for tissue regrowth. As yet another alternative, the filling material may be integrally formed on a post whereby a single post unit comprises a combined endodontic post and tip of filling material. To use the post unit, the tip of the device is softened by placing in an oven or heater to heat and soften the filling material or chemically treating to soften the material. The device will then be placed in a root canal that has been opened to a predetermined dimension by use of endodontic files, to seal the apical end. If necessary, the filling material can be compacted toward the apex, while it is still in the softened state, to ensure the apex is adequately sealed. The post may then be cemented into place by lining the canal walls with a bonding agent and filling the interface between the post and the walls of the canal with a resin cement such as a dual cure cement, a light cure cement or a self cure cement such as FiberFill™ RCS root canal sealant or Cement-It® Universal cement, both available from Pentron Clinical Technologies, LLC in Wallingford, Conn. This will result in a coronal seal of the canal via a resin restorative material and an apical seal of the canal by means of a filling material and sealant. The remaining portion of the post, extending supra-gingivally, will be used to build a core around it. Any excess will be cut off. One length of the device will be longer to accommodate the longer roots in anterior teeth. Another length will be shorter to accommodate smaller roots in the molar region. Various diameters may also be provided to accommodate the different sizes of root canals. The bonded flexible post may strengthen the tooth to prevent subsequent root fractures. Reference is made to FIGS. 3 through 6 which show carriers having the filling material applied to the tip of the carrier. FIG. 3 shows an appliance 10 having a handle 12 and an elongated shaft 14. Shaft 14 has a proximal end 14p and a distal end 14d that fits in a root canal. A sliding support 16 is positioned between shaft 14 and handle 12 to serve as an indicator of the depth of the canal and to help maintain the carrier in place. After the appliance is inserted in the canal, sliding support 16 is moved to the point at the top of the canal. Filling material 18, containing a biodegradable thermoplastic polymer and a bioactive filler, is positioned on the shaft, starting at the proximal end and continuing down, over the distal end. Reference is hereby made to commonly assigned U.S. Pat. Nos. 6,447,297 and 6,428,319, and commonly assigned U.S. patent application Ser. No. 10/164,512 filed Jun. 6, 2002, each directed to posts or obturators having filling materials integrally formed thereon, and all of which are hereby incorporated by reference. Turning to FIG. 4, a post unit 20 is shown comprising a post section 21 and a cone or tip section 24. Tip section 24 comprises a flexible rod or cone comprising a biodegradable thermoplastic polymer in combination with a bioactive substance for filling the apex of the canal. The filling material may include additives typical in the dental field such as plasticizing, antibiotic, cariostatic, antibacterial, or other anti-inflammatory, biologically active or therapeutic materials. Post section 21 comprises a main body or endodontic portion 22 and a carrier or apical portion 23, which is located at the apical end of post unit 20. Main body 22 may be a solid rod of circular or other suitable cross-section comprising a substantially smooth surface or may comprise a plurality of frustoconical sections arranged coaxially along the longitudinal axis of main body 22. Preferably, main body 22 has consistent width along the longitudinal axis thereof whereas frustoconical sections each have the same tapered width and same length. It is possible to vary the width and/or length of main body 22 and/or vary the tapered width and/or length of frustoconical sections along the longitudinal axis of main body 22. Carrier 23 is preferably an extension of main body 22 of post section 21 and is of very fine diameter to accommodate tip section 24 of thermoplastic material of post unit 20. In one method of manufacture which will be discussed hereinafter, post section 21 is manufactured from a rod of material that is cut or machined at the apical end to result in carrier 23 having a very small width or diameter in comparison to main body 22. Carrier 23 is of small diameter to allow enough area to form tip section 24 thereon, and also of enough strength and integrity to accommodate the filling material as discussed above. As stated above, carrier 23 is preferably an extension of main body 22 and is shown having constant diameter along the length thereof, but may be of any shape or size sufficient to hold tip section 24 thereon. Post section 21 may be fabricated of any material to provide a flexible apical portion and a more rigid endodontic and/or coronal or supracoronal portion, such as metal, plastic, ceramic, polymeric, composite, or other material suitable for placement in the mouth. Composite materials include but are not limited to filler reinforced composite materials and fiber reinforced composite materials comprising the reinforcing component in a polymeric matrix material such as those composite materials listed in U.S. Pat. Nos. 4,717,341 and 4,894,012 to Goldberg et al., U.S. Pat. No. 6,039,569 to Prasad et al., U.S. Pat. No. 6,030,220 to Karmaker et al, U.S. Pat. No. 5,564,929 to Alpert, and U.S. Pat. No. 5,919,044 to Sicurelli, Jr. et al., all of which are hereby incorporated by reference. The fiber reinforced composite material may comprise fibers in the form of long, unidirectional, continuous filaments which are preferably at least partially aligned and oriented along the longitudinal dimension of the component with alignment normal or perpendicular to that dimension also possible. The fibers may be of uniform or random length, unidirectional or multidirectional, or randomly dispersed, and may be as short as about 3 to about 4 millimeters (mm) or shorter. The fibers may also be in the form of fabric as set forth in copending Ser. No. 09/280,760 filed Mar. 29, 1999, now U.S. Pat. No. 6,186,791, and may include any of the attributes of the post described therein, the contents all of which are hereby incorporated by reference. Due to the improved structural integrity, the amount of fibers in the structural component preferably equals at least about 20% by weight (wt %) and preferably about 20 wt % to about 70 wt %. Possible reinforcing fibers, which are preferably used in accordance with U.S. Pat. Nos. 4,717,341 and 4,894,012 to Goldberg et al. (which are herein incorporated by reference), include glass, ceramic, metal, carbon, graphite, polymeric such as cellulose, polyamide, aramid, polyester, polyaramid, acrylic, vinyl and modacrylic, polyolefin, polytetrafluorethylene, mixtures thereof, as well as other fibers known in the art. One preferred version of the device is comprised of unidirectional microfilamentous glass fibers bundled in a resin matrix. In order to enhance the bond between the fibers and polymeric matrix, thereby enhancing the reinforcing effect, the fibers may be silanized or otherwise treated such as by grafting functional monomers to obtain proper coupling between the fibers and the resin matrix. Silanization renders the fibers hydrophobic, reducing the water sorption and improving the hydrolytic stability of the composite material, renders the fibers organophilic, improving wetting and mixing, and bonds the fibers to the polymeric matrix. Typical silane is A-174 (p-methacrylate propyl tri-methoxy silane), produced by OSI Specialties, New York. The polymeric matrix is selected from those known in the art of dental materials, including, but not limited to, polyamides, polyester, polyolefins, polyimides, polyarylates, polyurethanes, vinyl esters or epoxy-based materials, styrenes, styrene acrylonitriles, ABS polymers, polysulfones, polyacetals, polycarbonates, polyphenylene sulfides, polyarylsulfides, acrylonitrile-butadiene-styrene copolymers, polyurethane dimethacrylates (hereinafter abbreviated to PUDMA), and the like. Preferred polymeric matrix materials include those based on acrylic and methacrylic monomers, for example those disclosed in U.S. Pat. Nos. 3,066,112, 3,179,623, and 3,194,784 to Bowen; U.S. Pat. Nos. 3,751,399 and 3,926,906 to Lee et al.; and commonly assigned U.S. Pat. Nos. 5,276,068 to Waknine (which are herein incorporated by reference). An especially preferred methacrylate monomer is the condensation product of bisphenol A and glycidyl methacrylate, 2,2′-bis [4-(3-methacryloxy-2-hydroxy propoxy)-phenyl]-propane (hereinafter abbreviated “BIS-GMA”). The polymer matrix, which typically includes polymerization initiators, polymerization accelerators, ultra-violet light absorbers, anti-oxidants, fluorescent whitening agents, free radical initiators, and/or other additives well known in the art, may be visible light curable, self-curing, dual curing, or vacuum, heat, or pressure curable compositions, as well as any combination thereof. Heat and pressure or vacuum curable compositions include a heat cure initiator such as benzoyl peroxide, 1,1′-azobis(cyclohexanecarbo-nitrile) or other free radical initiators. The preferred polymeric matrix is a light and heat curable matrix, wherein light effects partial cure of the polymer matrix, while final curing is by heat under controlled atmosphere. Fillers may be present in addition to or instead of fibers in an amount up to about 80 wt %, and preferably about 70 wt %. If fibers are present, the amount of filler is present in an amount of up to about 30 wt % of one or more fillers known in the art and used in dental restorative materials. Suitable fillers include those capable of being covalently bonded to the polymeric matrix itself or to a coupling agent that is covalently bonded to both. Fillers include silica, silicate glass, quartz, barium silicate, strontium silicate, barium borosilicate, strontium borosilicate, borosilicate, lithium silicate, amorphous silica, ammoniated or deammoniated calcium phosphate and alumina, zirconia, tin oxide, and titania, among other conventional fillers such as those disclosed in commonly assigned U.S. Pat. Nos. 4,544,359 and 4,547,531 to Waknine (which are incorporated herein by reference), while possible coupling agents include silanes, zirconates, and titanates. If the post is manufactured from a composite material, it is preferably in completely cured or hardened state. Examples of metals useful as post section 21 include but are not limited to metals or alloys of Pd, Pt, Rh, Ir, Au, Ag, Ti, Co, Mo and mixtures thereof such as AgPd, AuPtPd, TiAlFe, TiAIV, CoCrMo, stainless steel and brass. Ceramic materials useful in the fabrication of post section 21 include but are not limited to alumina, zirconia, mullite, spinel, porcelain, titania, lithium disilicate, leucite, amorphous glass, lithium phosphate, and combinations thereof, or any high strength ceramic material which can withstand the stresses created in the mouth. Carrier 23 preferably comprises a smooth surface, although it is in no way limited to such and may be of any surface suitable for application of filling material thereon. The post may be provided in an opaque tooth color or it may be colored similar to a tooth's pulp for enhanced esthetics. The post may include an appropriate amount of radiopaque material such as titanium oxide, barium sulfate, and similar materials known in the dental industry to insure x-ray documentation which may be added to the post material during manufacture thereof. After post section 21 has been manufactured, carrier 23 of post section 21 is then coated with a filling material such as set forth above to obtain cone section 24 thereon. The filling material may be applied by any known means such as dipping, injection molding, hand rolling, and the like. To use the post unit, the device may be used as is, or may be heated by placing in or near an oven or heater to heat and soften the filling material or dipped in a chemical solution such as chloroform to soften the filling material. The device will then be placed in a root canal that has been opened to a predetermined dimension by use of endodontic files, to seal the apical end. If necessary, the filling material can be compacted toward the apex, while it is still in the softened state, to ensure the apex is adequately sealed. The post is then cemented into place by lining the canal walls with a bonding agent and filling the interface between the post and the walls of the canal with a resin cement, such as a dual cure cement. This will result in a coronal seal of the canal via resin restorative material and an apical seal of the canal by means of filling material and sealant. The remaining portion of the post, extending supra-gingivally, will be used to build a core around it, and if necessary, for placement of a crown thereon. Any excess of the post will be cut off. One length of the device will be longer to accommodate the longer roots in anterior teeth. Another length will be shorter to accommodate smaller roots in the molar region. FIG. 5 shows a post unit 30 comprises a post section 32 fabricated of fiber reinforced composite material. Post section 32 includes main body 34 and carrier 36. Carrier 36 is coated with a filling material to obtain cone section 38 thereon. As shown in the drawing, main body 34 is tapered to provide ease of placement into the canal. The cross-section of post unit 30 may be smaller than the cross-section of a standard post to fit in thinner or smaller auxiliary canals which are normally filled with a thermoplastic material. Accordingly, post unit 30 can act as an obturator. As an obturator, better support is provided due to the fiber-reinforced composite structural component 34 upon which cone section 38 is applied in comparison to using only a thermoplastic material as an obturator. Moreover, the obturator may be easily cemented in place in the canal. Post unit 30 may also include a handle 40 which is beneficial when the post unit is used as an obturator. Handle 40 may be any filled or unfilled polymeric material, such as those mentioned above and used in the fabrication of the post. FIG. 6 is directed to an obturator 40 having filling core or point 42 and a handle 44. Filling core 42 is a shaft 46 having a proximal end 46p and a distal end 46d that fits in a root canal. A sliding support 48 is positioned between shaft 46 and handle 44 to serve as an indicator of the depth of the canal and to help maintain the obturator in place. After the appliance is inserted in the canal, sliding support 48 is moved to the point at the top of the canal. Obturator 40 is cut off at the point desired to fit the canal. Filling core 42 containing a biodegradable thermoplastic polymer and optionally, a bioactive filler, in the form of shaft 46, fills the canal. The filling core 42 and handle 44 are a single unit fabricated of a biodegradable thermoplastic polymer and optionally, a bioactive filler. Alternatively, the filling core is made of a biodegradable thermoplastic polymer and optionally, a bioactive filler and the handle may be fabricated of any know material including but not limited to metal, plastic, composite, ceramic, glass or polymeric material. The compositions of the inventive materials have a radiopacity similar to gutta-percha materials. While various descriptions of the present invention are described above, it should be understood that the various features can be used singly or in any combination thereof. Therefore, this invention is not to be limited to only the specifically preferred embodiments depicted herein. Further, it should be understood that variations and modifications within the spirit and scope of the invention may occur to those skilled in the art to which the invention pertains. Accordingly, all expedient modifications readily attainable by one versed in the art from the disclosure set forth herein that are within the scope and spirit of the present invention are to be included as further embodiments of the present invention. The scope of the present invention is accordingly defined as set forth in the appended claims."
}