{
    "application_number": "10488451",
    "publication_number": "US20050008692A1-20050113",
    "title": "Compositions comprising pectin and ascorbic acid",
    "decision": "REJECTED",
    "date_produced": "20041229",
    "date_published": "20050113",
    "main_cpc_label": "",
    "cpc_labels": [],
    "main_ipcr_label": "",
    "ipcr_labels": [],
    "patent_number": "None",
    "filing_date": "20040303",
    "patent_issue_date": "",
    "abandon_date": "20090217",
    "uspc_class": "424",
    "uspc_subclass": "489000",
    "examiner_id": "59706.0",
    "examiner_name_last": "BETTON",
    "examiner_name_first": "TIMOTHY",
    "examiner_name_middle": "",
    "inventor_list": [
        {
            "inventor_name_last": "Chen",
            "inventor_name_first": "Chyi-cheng",
            "inventor_city": "Binningen",
            "inventor_state": "",
            "inventor_country": "CH"
        },
        {
            "inventor_name_last": "Leuenberger",
            "inventor_name_first": "Bruno",
            "inventor_city": "Allschwil",
            "inventor_state": "",
            "inventor_country": "CH"
        }
    ],
    "abstract": "Ascorbic acid compositions in the form of a powder and/or granules contain as principle components L-ascorbic acid and/or a pharmaceutically acceptable salt thereof, and a high molecular (300 kDalton or higher) pectin. The compositions are compressible into tablets with improved mechanical strength and hardness.",
    "claims": "1. A composition in the form of a powder or granules comprising: (a) L-ascorbic acid and/or a pharmaceutically acceptable salt thereof, (b) high molecular pectin. 2. A composition according to claim 1, wherein the high molecular pectin has an average molecular weight of about 300 kDalton or higher. 3. A composition according to claim 1, wherein the high molecular pectin has an average molecular weight of about 300 kDalton to about 400 kDalton. 4. A composition according to claim 1, wherein the high molecular pectin has an average molecular weight of about 350 kDalton. 5. A composition according to claim 1 wherein the L-ascorbic acid and/or a pharmaceutically acceptable salt thereof is sodium L-ascorbate. 6. A composition according to claim 1, wherein the pectin is present in quantities within the range of about 0.1% to about 10% by weight, calculated on the total weight of the composition. 7. A composition according to claim 1, wherein the pectin is present in quantities within about 0.5% to about 2% by weight, calculated on the total weight of the composition. 8. A composition according to claim 1, wherein said composition consists of 95-99% by weight of L-ascorbic acid and/or a pharmaceutically acceptable salt thereof and 5-1% by weight of pectin, the two components totaling 100% by weight. 9. A composition according to claim 1 in the form of a compressed tablet. 10. (Canceled). 11. A composition according to claim 1 further comprising an adjuvant or excipient. 12. A composition according to claim 2 wherein the L-ascorbic acid and/or a pharmaceutically acceptable salt thereof is sodium L-ascorbate. 13. A composition according to claim 3 wherein the L-ascorbic acid and/or a pharmaceutically acceptable salt thereof is sodium L-ascorbate. 14. A composition according to claim 4 wherein the L-ascorbic acid and/or a pharmaceutically acceptable salt thereof is sodium L-ascorbate. 15. A composition according to claim 11 wherein the L-ascorbic acid and/or a pharmaceutically acceptable salt thereof is sodium L-ascorbate. 16. A composition according to claim 5, wherein the pectin is present in quantities within the range of about 0.1% to about 10% by weight, calculated on the total weight of the composition. 17. A composition according to claim 11, wherein the pectin is present in quantities within the range of about 0.1% to about 10% by weight, calculated on the total weight of the composition. 18. A composition according to claim 5, wherein the pectin is present in quantities within about 0.5% to about 2% by weight, calculated on the total weight of the composition. 19. A composition according to claim 5, wherein said composition consists of 95-99% by weight of L-ascorbic acid and/or a pharmaceutically acceptable salt thereof and 5-1% by weight of pectin, the two components totaling 100% by weight. 20. A composition according to claim 5 in the form of a compressed tablet.",
    "background": "",
    "summary": "",
    "full_description": "The present invention relates to a composition in the form of a powder and/or granules, which contain as principal components L-ascorbic acid and/or a pharmaceutically acceptable salt thereof, and high molecular pectin. The composition according to the present invention is directly compressible into tablets with good taste, improved mechanical strength and hardness, with excellent color stability and is free of sugar and starch. The addition of adjuvants and excipients to the composition for producing tablets is optional. Compositions comprising L-ascorbic acid and/or a pharmaceutically acceptable salt thereof and pectin, as well as tablets manufactured using such compositions have been described in European Patent Application No.1 110 550 A2. It has now been found that tablets manufactured using a composition comprising L-ascorbic acid and/or its salts, and high molecular pectin show improved hardness as compared to tablets manufactured using conventional pectin of lower molecular weight. Thus, in one aspect the invention relates to a composition in the form of a powder or granules comprising: (a) L-ascorbic acid and/or a pharmaceutically acceptable salt thereof, (b) high molecular pectin and, optionally, (c) adjuvants and excipients. The term “high molecular pectin” as used herein denotes pectin having an average molecular weight of about 300 kDalton or higher. The preferred high molecular pectins are those having an average molecular weight of from about 300 kDalton to about 400 kDalton, particularly 350 kDalton. Such pectins can be obtained as disclosed in U.S. Pat. No. 6,143,337 (inventors: Marshall L. Fishman and Hoa K. Chau, assignors to The United States of America as represented by the Secretary of Agriculture) the contents of which is incorporated herein by reference. The average molecular weight is determined by size exclusion chromatography having a multi angle laser light scattering detector as described in U.S. Pat. No. 6,143,337. However, pectins of higher molecular weight, e.g. up to 2000 kDalton can be used also in the present invention. Pectins of such molecular weight can be obtained e.g. from Asteraceae plants, especially cichory and Jerusalem artichoke, see International patent application WO 99/03892. Fractions of the desired high molecular weight can be obtained from such pectins by membrane filtration, e.g. using polyethersulfone or composite regenerate cellulose membranes as supplied by Millipore Corporation, Bedford, Mass. 01730, USA, under the trade name Pellicon® Tangential Flow Filtration Cassettes. In accordance with the present invention, the high molecular pectin is preferably used in quantities within the range of about 0.1% to about 10% by weight, preferably in quantities of about 0.5% to about 5% by weight and most preferably in quantities of about 0.5% to about 2% by weight, calculated to the total weight of the composition thereof. Experiments have shown that a composition consisting of 95-99% by weight of L-ascorbic acid and/or the pharmaceutically acceptable salt thereof and 5-1% by weight of pectin, the two components totalling 100% by weight, i.e. with no other components present, yield tablets of very good quality and excellent color stability. Adjuvants may optionally be added. Suitable adjuvants are for example starch, HPMC, polyols. Preferably no adjuvants are added. The composition of this invention may be produced by any method known per se for the production of powders or granules. Preferred are fluidized-bed granulation, high-shear granulation, extrusion, spray-drying and wet granulation. For obtaining the composition of the present invention by spray-drying it is convenient to prepare an aqueous slurry of all the components. The slurry has preferably a solid content of about 10 to 70% by weight, and preferably about 30 to 70% by weight. The slurry is then spray-dried in a manner known per se. For obtaining the composition of the present invention by fluidized-bed granulation it is convenient to use a known fluidized-bed granulating apparatus which comprises a fluidized-bed drying device fitted with spray means. Preferably the L-ascorbic acid and/or a pharmaceutically acceptable salt thereof form the fluidized bed, which is fluidized by air or an inert gas, e.g. nitrogen. The pectin, as well as optional adjuvants, dissolved in an appropriate amount of water and sprayed in the form of an atomized mist onto the fluidized particles in such a manner that the granulating and drying operations is accomplished in a single step. The granulating process is continued until the desired amount of the pectin binder has been deposited onto the fluidized particles. The granules are sieved to remove the fractions of granules which are either too large or too small. Preferably, the particle size of the granules is within 100 and 1000 micron, more preferably between 125 and 850 microns. While the so-obtained granules are substantially dry they may contain a very small percentage of water depending on the amount of pectin. For 1% pectin, the moisture content is about 0.2% or less. For 5% pectin, the moisture content may be as high as 1%. The composition thus obtained may be compressed into tablets with conventional tabletting methods and machinery. Optionally the powder or the granules may further be mixed with a lubricant or a mixture of lubricants and then compressed into tablets. If additional lubricant is used it is preferably selected from the group of stearic acid or the magnesium or calcium salt thereof, or glyceryl behenate 45 (Compritol 888 ATO), preferably in an amount of about 0.5 to 4% by weight, calculated to the total weight of the composition. Or the composition may be mixed with excipients. Examples for excipients are dextrinized sucrose (Di Pac sugar), microcrystalline cellulose or starch. A single tablet as obtained according to the present invention contains preferably 50 mg to 1500 mg, preferably 500 mg to 1000 mg of L-ascorbic acid and/or the pharmaceutically acceptable salt thereof, corresponding to an appropriate daily doses of vitamin C. The following Example illustrates the invention further. EXAMPLE Two pectins having different molecular weight were investigated. One had an average molecular weight of 200 kDalton (USP/100, lot 02635-0, CP Kelco, San Diego, USA) and another had an average molecular weight of about 350 kDalton. The 350 kDalton pectin was a sample from the United States Department of Agriculture and was prepared by the process disclosed in U.S. Pat. No. 6,143,337. A 1.9% pectin solution was prepared by dissolving pectin in water. Sodium ascorbate powder (F. Hoffmann—La Roche AG, Switzerland, Ave. particle size ca. 50 microns) was placed in a Glatt Fluidized-Bed granulator (Model Uniglatt, Switzerland) and sprayed with a fine mist of the pectin solution, which was kept at about 50° C. during spraying. The granulation conditions were as follows: L-Sodium ascorbate: 400 g 1.9% Pectin solution: 213 g Pectin solution spraying rate: 9.9 g/minute Inlet air temperature: 80° C. Outlet air temperature: 40° C. Product temperature: 32° C. The granules had a particle size distribution as shown in Table 1. The granules (125-850 micron fraction) were mixed with the excipients as shown in Table 2 and then compressed into 700-mg tablets with a diameter of 12 mm to tablets of various thickness. The hardness of the tablets was determined and is shown in Table 3. TABLE 1 Particle Size Distribution, % Particle Size (Microns) >850 >710 >500 >355 >250 >125 <125 Pectin USDA (C99-482) 8.5 6.2 17.2 20.8 21.0 20.2 6.1 Pectin USP100 CP Kelco 15.3 6.1 14.1 16.8 19.8 21.0 7.0 (lot 02635-0) TABLE 2 Parts Granule sample prepared 100 from the example Roche Ascorbic Acid 90% 65.84 Granulation White Di Pac sugar 249.04 Compritol 888 ATO 8.48 TABLE 3 CP Kelco Pectin Pectin USDA USP100 (C99-482) (lot 02635-0) Mol. Weight: 350 Mol. Weight: 200 kDalton kDalton Tablet Tablet Tablet Tablet Thickness Hardness Thickness Hardness mm N mm N 4.30 146.6 4.31 134.3 4.15 202.3 4.16 175.5 4.05 238.6 4.04 208.5 3.98 255.0 3.98 234.8 3.94 268.6 3.93 243.1 3.97 297.4 n.a. n.a. n.a.: not available The results of Table 3 show that the use of the high molecular pectin (MW 350 kDalton) resulted in tablets of substantially higher hardness when the same or substantially the same tabletting parameters were applied."
}